app/controllers/gossipform_controller.rb

    def create
        @gossip = Gossip.new('user_id' => User.all.sample.id,
                            'title' => params[:title],
                            'content' => params[:content]) # avec xxx qui sont les données obtenues à partir du formulaire
        if @gossip.save # essaie de sauvegarder en base @gossip
---
SELECT "users".* FROM "users"
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Projet"], ["content", "Le projet il souuuuuuuulee"], ["user_id", 1], ["created_at", "2023-05-11 15:47:25.962760"], ["updated_at", "2023-05-11 15:47:25.962760"]]

    def index
        @gossips = Gossip.all # Méthode qui récupère tous les potins et les envoie à la view index (index.html.erb) pour affichage
---
SELECT "gossips".* FROM "gossips"